iknow-api/quizknow/app/controllers/conversions_controller.rb

SELECT * FROM "authtokens" WHERE ("authtokens"."username" = 'takano32') LIMIT 1
---
  def create
    authtoken = Authtoken.find_by_username(params[:conversion][:iknow_username])